Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_CCM.h
/* The count of CCM_CLOCK_GROUP_AUTHEN_TOG */
#define CCM_CLOCK_GROUP_AUTHEN_TOG_COUNT         (2U)

/*! @name CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT - Setpoint setting */
/*! @{ */

#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_DIV0_MASK (0xFU)
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_DIV0_SHIFT (0U)
/*! DIV0 - Clock divider
 *  0b0000..Direct output.
 *  0b0001..Divide by 2.
 *  0b0010..Divide by 3.
 *  0b0011..Divide by 4.
 *  0b1111..Divide by 16.
 */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_DIV0(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_DIV0_SHIFT)) & CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_DIV0_MASK)

#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_RSTDIV_MASK (0xFF0000U)
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_RSTDIV_SHIFT (16U)
/*! RSTDIV - Clock group global restart count */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_RSTDIV(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_RSTDIV_SHIFT)) & CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_RSTDIV_MASK)

#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_OFF_MASK (0x1000000U)
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_OFF_SHIFT (24U)
/*! OFF - OFF
 *  0b0..Clock is running.
 *  0b1..Turn off clock.
 */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_OFF(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_OFF_SHIFT)) & CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_OFF_MASK)

#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_GRADE_MASK (0xF0000000U)
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_GRADE_SHIFT (28U)
/*! GRADE - Grade */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_GRADE(x) (((uint32_t)(((uint32_t)(x)) << CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_GRADE_SHIFT)) & CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_GRADE_MASK)
/*! @} */

/* The count of CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_COUNT (2U)

/* The count of CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT */
#define CCM_CLOCK_GROUP_CLOCK_GROUP_SETPOINT_SETPOINT_COUNT2 (16U)

/*! @name GPR_SHARED - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED_GPR_MASK                  (0xFFFFFFFFU)
#define CCM_GPR_SHARED_GPR_SHIFT                 (0U)
/*! GPR - GP register */
#define CCM_GPR_SHARED_GPR(x)                    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_GPR_SHIFT)) & CCM_GPR_SHARED_GPR_MASK)
/*! @} */

/*! @name GPR_SHARED_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED_SET_GPR_MASK              (0xFFFFFFFFU)
#define CCM_GPR_SHARED_SET_GPR_SHIFT             (0U)
/*! GPR - GP register */
#define CCM_GPR_SHARED_SET_GPR(x)                (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_SET_GPR_SHIFT)) & CCM_GPR_SHARED_SET_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_SHARED_SET */
#define CCM_GPR_SHARED_SET_COUNT                 (8U)

/*! @name GPR_SHARED_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED_CLR_GPR_MASK              (0xFFFFFFFFU)
#define CCM_GPR_SHARED_CLR_GPR_SHIFT             (0U)
/*! GPR - GP register */
#define CCM_GPR_SHARED_CLR_GPR(x)                (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_CLR_GPR_SHIFT)) & CCM_GPR_SHARED_CLR_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_SHARED_CLR */
#define CCM_GPR_SHARED_CLR_COUNT                 (8U)

/*! @name GPR_SHARED_TOG - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED_TOG_GPR_MASK              (0xFFFFFFFFU)
#define CCM_GPR_SHARED_TOG_GPR_SHIFT             (0U)
/*! GPR - GP register */
#define CCM_GPR_SHARED_TOG_GPR(x)                (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_TOG_GPR_SHIFT)) & CCM_GPR_SHARED_TOG_GPR_MASK)
/*! @} */

/* The count of CCM_GPR_SHARED_TOG */
#define CCM_GPR_SHARED_TOG_COUNT                 (8U)

/*! @name GPR_SHARED_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED_AUTHEN_TZ_USER_MASK       (0x1U)
#define CCM_GPR_SHARED_AUTHEN_TZ_USER_SHIFT      (0U)
/*! TZ_USER - User access
 *  0b0..Clock cannot be changed in user mode.
 *  0b1..Clock can be changed in user mode.
 */
#define CCM_GPR_SHARED_AUTHEN_TZ_USER(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_SHARED_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_SHARED_AUTHEN_TZ_NS_MASK         (0x2U)
#define CCM_GPR_SHARED_AUTHEN_TZ_NS_SHIFT        (1U)
/*! TZ_NS - Non-secure access
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED_AUTHEN_TZ_NS(x)           (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_SHARED_AUTHEN_LOCK_TZ_MASK       (0x10U)
#define CCM_GPR_SHARED_AUTHEN_LOCK_TZ_SHIFT      (4U)
/*! LOCK_TZ - Lock truszone setting
 *  0b0..Trustzone setting is not locked.
 *  0b1..Trustzone setting is locked.
 */
#define CCM_GPR_SHARED_AUTHEN_LOCK_TZ(x)         (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_SHARED_AUTHEN_WHITE_LIST_MASK    (0xF00U)
#define CCM_GPR_SHARED_AUTHEN_WHITE_LIST_SHIFT   (8U)
/*! WHITE_LIST - Whitelist
 *  0b0000..This domain is NOT allowed to change clock.
 *  0b0001..This domain is allowed to change clock.
 */
#define CCM_GPR_SHARED_AUTHEN_WHITE_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED_AUTHEN_WHITE_LIST_MASK)

#define CCM_GPR_SHARED_AUTHEN_LOCK_LIST_MASK     (0x1000U)
#define CCM_GPR_SHARED_AUTHEN_LOCK_LIST_SHIFT    (12U)
/*! LOCK_LIST - Lock Whitelist
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_SHARED_AUTHEN_LOCK_LIST(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_SHARED_AUTHEN_DOMAIN_MODE_MASK   (0x10000U)
#define CCM_GPR_SHARED_AUTHEN_DOMAIN_MODE_SHIFT  (16U)
/*! DOMAIN_MODE - Low power and access control by domain
 *  0b0..Clock does NOT work in Domain Mode.
 *  0b1..Clock works in Domain Mode.
 */
#define CCM_GPR_SHARED_AUTHEN_DOMAIN_MODE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_DOMAIN_MODE_SHIFT)) & CCM_GPR_SHARED_AUTHEN_DOMAIN_MODE_MASK)

#define CCM_GPR_SHARED_AUTHEN_LOCK_MODE_MASK     (0x100000U)
#define CCM_GPR_SHARED_AUTHEN_LOCK_MODE_SHIFT    (20U)
/*! LOCK_MODE - Lock low power and access mode
 *  0b0..MODE is not locked.
 *  0b1..MODE is locked.
 */
#define CCM_GPR_SHARED_AUTHEN_LOCK_MODE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED_AUTHEN_LOCK_MODE_SHIFT)) & CCM_GPR_SHARED_AUTHEN_LOCK_MODE_MASK)
/*! @} */

